app/views/gossips/show.html.erb

      <h3 class="card-text mb-5">Content: <%= @gossip.content %></h3>
      <h3 class="card-text mb-5">User name: <%= @gossip.user.first_name %></h3>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]