app/views/pages/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <h5 class="card-title"><%= gossip.title %><br/></h5>
    <p class="card-text"><%= gossip.content %><br/><%= gossip.user.first_name %><br/></p>