app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "You"], ["content", "hissing"], ["created_at", "2019-10-31 16:46:32.507910"], ["updated_at", "2019-10-31 16:46:32.507910"], ["user_id", 11]]
---
    def create
        puts "$" * 60
        puts "ceci est le contenu de params :"
        puts params
        @gossip = Gossip.new(title: params[:title], content: params[:content])

        #user_id: 11 correspond à l'ID anonymous après généré 10 Fakers Users via seed et créé manuellement l'user anonymous dans la console.

        if @gossip.save # essaie de sauvegarder en base @gossip

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "new contn"], ["updated_at", "2019-10-31 17:27:32.774960"], ["id", 21]]
---
    def update
      @gossip = Gossip.find(params[:id])
      if @gossip.update(title: params[:title], content: params[:content])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 1]]
---
    def destroy
      @gossip = Gossip.find(params[:id])
      @gossip.destroy!