app/controllers/pages_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @allgossips = Gossip.all